### Create a pandas series with a nan value

In [1]:
import pandas as pd, numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

### Check how many values of dataframe are null

In [2]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
string_data[0] = None

string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Now we'll use drop function to drop the rows with NaN entries

In [4]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

### Instead of using drop, we can also use notnull() that returns a list of indices in dataframe that are not null and those indices can be used to get not null entries

In [5]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

### dropna() function returns the copy of dataframe after removing NaN values. It does not make any change to actual dataframe

In [6]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [7]:
cleaned = data.dropna()

In [8]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
cleaned

     0    1    2
0  1.0  6.5  3.0

### By using how = 'all' as a parameter we can tell the function that we want to drop only those rows, where all entries are NaN eg. row_2

In [10]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

### We can add a row of all NaN values into dataframe simply by putting dataframe[Column_name] = NA

In [11]:
data[4] = NA

In [12]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

### We can also remove a column from dataframe by simply passing an axis(=1) in dropna()

In [13]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

### Using loc[] and iloc[] one can also access a part of dataframe in all those cases where there is no need of considering complete dataframe

In [14]:
df = pd.DataFrame(np.random.randn(7, 3))

In [15]:
df.iloc[:4, 1] = NA

df.iloc[:2, 2] = NA
df

          0         1         2
0 -1.749809       NaN       NaN
1 -0.584165       NaN       NaN
2 -0.543738       NaN -0.282033
3 -0.049052       NaN -1.834864
4 -1.213536 -1.371080  0.166368
5 -0.799082 -0.148405  0.049917
6  1.334238  0.216821  0.542424

In [16]:
df.dropna()

          0         1         2
4 -1.213536 -1.371080  0.166368
5 -0.799082 -0.148405  0.049917
6  1.334238  0.216821  0.542424

### By passing thresh parameter one can define the threshold, any row is deleted where NaN are present beyond that threshold

In [17]:
df.dropna(thresh=2)

          0         1         2
2 -0.543738       NaN -0.282033
3 -0.049052       NaN -1.834864
4 -1.213536 -1.371080  0.166368
5 -0.799082 -0.148405  0.049917
6  1.334238  0.216821  0.542424

### You can simply fill NaN with a constant value using fillna() function

In [18]:
df.fillna(0)

          0         1         2
0 -1.749809  0.000000  0.000000
1 -0.584165  0.000000  0.000000
2 -0.543738  0.000000 -0.282033
3 -0.049052  0.000000 -1.834864
4 -1.213536 -1.371080  0.166368
5 -0.799082 -0.148405  0.049917
6  1.334238  0.216821  0.542424

### You can also pass a dictionary as fillna()'s parameter to define value that is to be filled in each column

In [19]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.749809  0.500000  0.000000
1 -0.584165  0.500000  0.000000
2 -0.543738  0.500000 -0.282033
3 -0.049052  0.500000 -1.834864
4 -1.213536 -1.371080  0.166368
5 -0.799082 -0.148405  0.049917
6  1.334238  0.216821  0.542424

### Pass True value to inplace parameter if you want the changes to happen at original dataframe

In [20]:
_ = df.fillna(0, inplace=True)

In [21]:
df

          0         1         2
0 -1.749809  0.000000  0.000000
1 -0.584165  0.000000  0.000000
2 -0.543738  0.000000 -0.282033
3 -0.049052  0.000000 -1.834864
4 -1.213536 -1.371080  0.166368
5 -0.799082 -0.148405  0.049917
6  1.334238  0.216821  0.542424

### You can also use ffill as method in fillna method to fill NaN with previous value

In [22]:
df = pd.DataFrame(np.random.randn(6, 3))

In [23]:
df.iloc[2:, 1] = NA

df.iloc[4:, 2] = NA

df

          0         1         2
0  0.652565 -0.755796  2.084942
1 -0.381266 -0.343734  1.240162
2 -0.258359       NaN  0.762582
3 -1.091031       NaN  2.199606
4  1.976783       NaN       NaN
5  1.272189       NaN       NaN

In [24]:
df.fillna(method='ffill')

          0         1         2
0  0.652565 -0.755796  2.084942
1 -0.381266 -0.343734  1.240162
2 -0.258359 -0.343734  0.762582
3 -1.091031 -0.343734  2.199606
4  1.976783 -0.343734  2.199606
5  1.272189 -0.343734  2.199606

### You can also limit number of rows to which you want to extrapolate by using limit parameter

In [25]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.652565 -0.755796  2.084942
1 -0.381266 -0.343734  1.240162
2 -0.258359 -0.343734  0.762582
3 -1.091031 -0.343734  2.199606
4  1.976783       NaN  2.199606
5  1.272189       NaN  2.199606

In [26]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [27]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Removing Duplicates

In [29]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [30]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

### Duplicated function is used to check which value is repeated

In [31]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

### Drop_Duplicates function can be used to drop rows where duplicate entries present

In [32]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [33]:
data['v1'] = range(7)

### You can also specify from which column you want to delete duplicate

In [34]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1